---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalLinkJoinedNodes
source: html/552f2e60-f1af-9142-f7e3-02c89ef9b7ab.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalLinkJoinedNodes Property

Analitycal Link is invalid. Reference nodes have been joined.

## Syntax (C#)
```csharp
public static FailureDefinitionId AnalyticalLinkJoinedNodes { get; }
```